[IO_InfectedDoor InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_Antidote MissionItemDefinition]
UseFailureCharacterMessage="come down %s use this."
ItemName="Opposite"
PickupMessage="you have %s"
UseFailureLevelMessage="You need at least %d to use this feature."
UseFailureConstraintsMessage="You cannot use this.."
NoManufacturerName="Absolute"

[ItemDefs.ID_Antidote:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="The Cassius Institute was established. He is immune to gas and can destroy Hector.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_CassiusBlood MissionItemDefinition]
UseFailureCharacterMessage="You must be the same %s Use these words."
ItemName="Cassia's blood test"
PickupMessage="You have %s"
UseFailureLevelMessage="You need at least %d to use this item."
UseFailureConstraintsMessage="You cannot use this.."
NoManufacturerName="In general"

[ItemDefs.ID_CassiusBlood:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Beautiful red dress."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_MordecaiBloodSample MissionItemDefinition]
UseFailureCharacterMessage="That's how it should be. %s To use this item."
ItemName="Mordecai's blood"
PickupMessage="to understand %s"
UseFailureLevelMessage="You must have level %d to use this feature.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="General medicine"

[ItemDefs.ID_MordecaiBloodSample:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Mod's Blood Plant. Don't let it fall.."
NoConstraintText=""
Suffix=""
Prefix=""

[M_Anemone_PlotMission050 MissionDefinition]
MissionName="All expenses"
MissionDescription="Hector tries to stop Cassius and send company. Fortunately, Cassius was able to stop the gas from turning into a monster. But you still have to go through the gas and clean yourself to get to Cassius Lab.."
TurnInDescription="Curse! What happened to those vegetables? \n\nCasio will ask you to collect a sample of Mordechai's tainted blood to complete the quest. You have to go through Dolly's old cursed mine to get there.."
MissionSummary="Go back down."
MissionGiver="FLORA"
MissionTurnInLocation="Hyperion Scanner from Cassius Labs"
TeaserText=""

[M_Anemone_PlotMission050:ActivateChamber MissionObjectiveDefinition]
ProgressMessage="Activate the cleaning process"

[M_Anemone_PlotMission050:CheckonMordecai MissionObjectiveDefinition]
ProgressMessage="to Mordecai"

[M_Anemone_PlotMission050:EnterChamber MissionObjectiveDefinition]
ProgressMessage="Go to the doctor's office"

[M_Anemone_PlotMission050:EnterDahlFacility MissionObjectiveDefinition]
ProgressMessage="Visit the Scarab Mountain Research Center"

[M_Anemone_PlotMission050:EnterDahlMine MissionObjectiveDefinition]
ProgressMessage="Dahl introduced me"

[M_Anemone_PlotMission050:GetMordecaiBlood MissionObjectiveDefinition]
ProgressMessage="Take a blood sample from Mordecai"

[M_Anemone_PlotMission050:KillCassius MissionObjectiveDefinition]
ProgressMessage="Kill the infected Cassius"

[M_Anemone_PlotMission050:LeavethePrisonarea MissionObjectiveDefinition]
ProgressMessage=""

[M_Anemone_PlotMission050:OpenDoor MissionObjectiveDefinition]
ProgressMessage="such as bonds"

[M_Anemone_PlotMission050:OpenValve MissionObjectiveDefinition]
ProgressMessage="Open the gas tank."

[M_Anemone_PlotMission050:ReachCassiusLab MissionObjectiveDefinition]
ProgressMessage="Enter Cassius's lab."

[M_Anemone_PlotMission050:ReachLab02 MissionObjectiveDefinition]
ProgressMessage="Go to the lab"

[M_Anemone_PlotMission050:ScanBloodSample MissionObjectiveDefinition]
ProgressMessage="Notice the blood of Mordecai"

[M_Anemone_PlotMission050:ScanCassiusBlood MissionObjectiveDefinition]
ProgressMessage="Cassius blood test"

[M_Anemone_PlotMission050:Set_ActivateChamber MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_CheckMordecai MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_EnterChamber MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_EnterDahlMine MissionObjectiveSetDefinition]
MissionSummaryOverride="Bring Mordecai's blood to Cassius.."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_EnterFacility MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_GetMordecaiBlood MissionObjectiveSetDefinition]
MissionSummaryOverride="He took blood from the tree.."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_KillCassius MissionObjectiveSetDefinition]
MissionSummaryOverride="Kill Cassius."
MissionDescriptionOverride="The purification process involves a sample of Mordecai's blood. If there is no infected blood sample, you will not be able to drill a hole. There was only one person with the same blood on the scene: Cassius was paralyzed and turned into a monster. Kill him and heal him.."

[M_Anemone_PlotMission050:Set_LeavePrisonArea MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_OpenBioContainmentValve MissionObjectiveSetDefinition]
MissionSummaryOverride="Open the emergency control room.."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_PrisonAmbush MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ReachCassiusLab1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ReachCassiusLab1b MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ReachCassiusLab2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ReachCassiusLab3 MissionObjectiveSetDefinition]
MissionSummaryOverride="Take Mordecai's blood for Cassi."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ScanBloodSample MissionObjectiveSetDefinition]
MissionSummaryOverride="Prepare a solution."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ScanCassiusBlood MissionObjectiveSetDefinition]
MissionSummaryOverride="Preparation for anesthesia."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_ShootElectricalBox MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_TakeAntidote MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_TakeCassiusBlood MissionObjectiveSetDefinition]
MissionSummaryOverride="Get Cassius' blood sample.."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_TalkToCassius MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_VentLab01 MissionObjectiveSetDefinition]
MissionSummaryOverride="Check out the lab."
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:Set_VentLab02 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:ShootElectricalBox MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_PlotMission050:ShootElectricalBox MissionObjectiveDefinition]
ProgressMessage="Light mixing box"

[M_Anemone_PlotMission050:ShootElectricBox MissionObjectiveDefinition]
ProgressMessage="Remove the junction box"

[M_Anemone_PlotMission050:SurviveAmbush MissionObjectiveDefinition]
ProgressMessage="Avoid the attacks"

[M_Anemone_PlotMission050:TakeAntidote MissionObjectiveDefinition]
ProgressMessage="Take medicine"

[M_Anemone_PlotMission050:TakeCassiusBlood MissionObjectiveDefinition]
ProgressMessage="Take the blood of Cassius"

[M_Anemone_PlotMission050:TalkToCassius MissionObjectiveDefinition]
ProgressMessage="Talk to Cassius"

[M_Anemone_PlotMission050:VentLab01 MissionObjectiveDefinition]
ProgressMessage="Ventilate the room"

[M_Anemone_PlotMission050:VentLab02 MissionObjectiveDefinition]
ProgressMessage="bladder"

